# Итоговая проверочная работа
## Описание решаемой задачи:
Написать программу, которая из имеющегося массива целых чисел формирует массив из четных чисел. Первоначальный массив можно ввести с клавиатуры, либо сгенерировать случайным образом.При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.
## Алгоритм решения
1. При решении задачи был выбран вариант с заполнением первоначального массива числами, сгенерированными случайным образом. Для этого была написана отдельная функция (метод) GetRandom с использованием встроенного генератора случайных чисел new Random().Next()

   '< int GetRandom (int MinValue, int MaxValue)
    {
        return new Random().Next(MinValue,MaxValue);
    }>'
2. Задан массив, состоящий из 10 элементов
'<int [] Array = new int [10];>'
3. Написана функция по заполнению созданного массива числами, сгенерированнанными случайным образом с использованием функции GetRandom (см. п.1 выше) со встроенной возможностью выведения чисел массива в строку консоли FillArray. Для функции GetRandom выбран диапазон чисел от (-10,10).

    '<void FillArray (int [] Array)
    {
        for (int i=0; i<Array.Length; i++)
            {
                Array[i] = GetRandom(-10,10);
                Console.Write($"{Array[i]} ; ");
            }
    }>'
4. Написана функция по формированию массива из четных чисел из заданного массива EvenNumbersArray. В функцию также встроено выведение получаемого массива в строку консоли.

    '<int EvenNumbersArray (int [] Array)
    {  int CountEven = 0;
        for (int j=0; j<Array.Length; j++)
        {
            if (Array[j]%2==0)
            {
                CountEven++;
                Console.Write($"{Array[j]} ; ");
            }
        } 
        return CountEven;
    }>'
5. Далее последовательно задаются фукнции FillArray и EvenNumbersArray
## Проверка кода и тесирование программы
Проведено несколько тестирующих закпусков программы. Программа работает. При тестировании ошибок в работе программы выявлено не было.